{"index":{"slug":"index","filePath":"index.md","title":"~/techsavvyash","links":["projects/BSAI"],"tags":[],"content":"I’m a software engineer trying to build systems which make people’s lives easier. I have 3 years of experience working on production systems for a couple of Indian states helping the under privileged strata of the population thanks to the amazing opportunities and problems I got to work on during my time at Samagra. Presently, I ship code at Zomato trying to get simplify the lives of merchants on the platform.\nI was part of the core team that built Bharat Sah’AI’yak which was acquired by OLA Krutrim in early 2025. BSAI is a AI enabled compute platform which could be modified for a wide range of usecases like ChatBots, information processing systems etc.\nI have a deep love for databases, distributed systems, PLT and open source. Currently, I am exploring making AI coding agents smarter and simplifying selling &amp; hosting APIs on the internet with my a small community of my friends over at TheFlywheel - Boutique AI Studio."},"blogs/index":{"slug":"blogs/index","filePath":"blogs/_index.md","title":"Blogs","links":[],"tags":[],"content":"Nothing here yet! Hopefully I start writing soon."},"projects/BSAI":{"slug":"projects/BSAI","filePath":"projects/BSAI.md","title":"Bharat Sah'AI'yak","links":[],"tags":["projects"],"content":"Bharat Sah’AI’yak or BSAI is a AI enabled compute platform aimed to be flexible enough to serve a varied variety of usecases from building RAG based chatbots (like AKAI, KMAI, MahaKumbh bot etc. - more on those in these later), data processing pipelines, testing suite for LLM response accuracy and a lot of other use cases -  since it is a compute platform was designed to behave more like a programming language on steroids.\nIn the early days the development, BSAI was adopted for Agriculture with a singular problem statement - getting the crop and cattle farming advisory at the finger tips of farmers keeping in mind their troubles with technology.\nThe BSAI team came up with just the right fit of solution which given the nature of business at Samagra was scalable and adaptable enough to be deployed in context of all the states where we were running agricultural advisory programs.\nThe project ran a successful pilot in two indian states:\n\nOdisha - Under the name of AmaKrushiAI chatbot (AKAI)\nUttar Pradesh - As KisanMitra AI (KMAI)\n\nAs part of improvements for these two production deployments being used by around 50K farmers per day we added auto training pipelines to keep the chatbots updated with latest agricultural advisory data which included of writing our own PDF parsers, table parser because the advisory from Indian meterological institutes of these state are in the form of printed textbook pdfs.\nAfter this BSAI was also used to build the chatbot for Maha Kumbh 2025 as a part of Government of India’s Digital India and Digital Kumbh initiatives where millions of devotees used the bot for a period of the festival and we served them seamlessly. Another thing which was special about MahaKumbh BSAI adoption was that it was the first time where external teams like OLA Krutrim and BeeHyv used and built on top of BSAI proving that the platform was mature enough to onboard external teams to just use the developer platform and build on top of it to power population scale use cases.\nBSAI was ultimately acquired by OLA Krutrim in early 2025 and is currently being worked on as part of Krutrim’s larger vision of building India’s own state of the art AI agent."},"projects/index":{"slug":"projects/index","filePath":"projects/_index.md","title":"My Work","links":[],"tags":[],"content":"I started programming in 2020 during CoVID-19 quarantine lockdown right after I graduated high school and appeard for JEE. I had a little bit of experience programming in python and writing HTML pages from my school days because those lectures on QBasic, HTML and Python and how it all seemed like wizardy at that time to a 12 year old is what gave birth to my love and passion for my craft.\nYou can read more about some of the bigger projects I have worked on from the list below."},"projects/Veil":{"slug":"projects/Veil","filePath":"projects/Veil.md","title":"Veil","links":[],"tags":["products","open-source"],"content":"Veil is a modded caddy module that"},"projects/Stylus":{"slug":"projects/Stylus","filePath":"projects/Stylus.md","title":"StylusDB","links":[],"tags":["projects","open-source","databases"],"content":""},"projects/RCW":{"slug":"projects/RCW","filePath":"projects/RCW.md","title":"Verifiable Credentials","links":[],"tags":["projects"],"content":"Introduction\nRegistry, Credentials and Wallet (RCW) is a project that implements the core Verifiable Credentials (VC) Specification published by W3C.\nInitial implemenetation of RCW was done as the core credentialling services for the Unified Learner’s Passbook (ULP) project which was proposed in the National Education Policy, 2020 (NEP 2020) by Ministry of Education, Government of India. The pilot launch of ULP is scheduled for the state of Uttar Pradesh, India (most populous state of India).\nOpen Source Relevance\nThe core services, namely, Credential-MS, Cred-Schema-MS and Identity were abstracted out and contributed to Sunbird RC. Sunbird RC is the software which powers the generation and management of credentials like our COVID Vaccination certificate in India. These core services are maintained by the original implementers, SamagraX alongside me here at Registry, Credentials and Wallet (RCW).\nLink to commits contributed by me to Sunbird RC for their 2.0 release\nArchitecture, Tech Stack and Deployment\nThese services follow a microservices architecture to enable credentialling in your project. The architecture of how these services work with each other is shown in the picture below.\n\nEach of these services are built using NestJS with TypeScript and come bundled with Dockerfile, Jenkinsfile and Ansible roles for easy deployment. The RCW Github Organisation has the devops which hosts a one click deployment mechanism of these services to be used in any project.\nReferences\n\nVerifiable Credentials Specification\nNational Education Policy 2020\nUnified Learner’s Passbook Github\nSunbird RC\nTeam SamagraX on Github\nRCW Github\n"},"projects/Beckn":{"slug":"projects/Beckn","filePath":"projects/Beckn.md","title":"Beckn","links":[],"tags":["projects","gov-tech","open-source"],"content":""},"projects/OIDC":{"slug":"projects/OIDC","filePath":"projects/OIDC.md","title":"OIDC Lite","links":[],"tags":["projects","open-source"],"content":""},"projects/Stencil":{"slug":"projects/Stencil","filePath":"projects/Stencil.md","title":"Stencil","links":[],"tags":["projects","open-source","frameworks"],"content":""}}